In [4]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine

**Engine de Conexão ao Banco de Dados MySQL.**

Sintaxe:
engine = sqlalchemy.create_engine('mysql+**drive://usuario:senha@ip-servidor:porta/banco-de-dados')**

In [12]:
# Criando o objeto conexão
engine = create_engine('postgresql://postgres:postgres@localhost:5432/vendas')

In [17]:
# lendo uma tabela com o método read_sql_table
df = pd.read_sql_table('cliente', engine)

In [18]:
df.head()

,codigocliente,nomecliente,endereco,cidade,cep,uf,cpf
0,20,Beth,Av. Climério n. 45,São Paulo,25679300,SP,32485126/7326-8
1,110,Jorge,Rua Caiapo 13,Curitiba,30078500,PR,14512764/9834-9
2,130,Edmar,Rua da Praia sn,Salvador,30079300,BA,23463284/234-9
3,157,Paulo,Tv. Moraes c/3,Londrina,None,PR,32848223/324-2
4,180,Lívio,Av. Beira Mar n. 1256,Florianópolis,30077500,SC,12736571/2347-4

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   codigocliente  14 non-null     int64
 1   nomecliente    14 non-null     object
 2   endereco       14 non-null     object
 3   cidade         14 non-null     object
 4   cep            13 non-null     object
 5   uf             14 non-null     object
 6   cpf            14 non-null     object
dtypes: int64(1), object(6)
memory usage: 912.0+ bytes

In [20]:
df.isnull().sum()

codigocliente    0
nomecliente      0
endereco         0
cidade           0
cep              1
uf               0
cpf              0
dtype: int64

**Método read_sql_query**

In [23]:
df = pd.read_sql_query('select * from cliente', engine)

In [24]:
df.head()

,codigocliente,nomecliente,endereco,cidade,cep,uf,cpf
0,20,Beth,Av. Climério n. 45,São Paulo,25679300,SP,32485126/7326-8
1,110,Jorge,Rua Caiapo 13,Curitiba,30078500,PR,14512764/9834-9
2,130,Edmar,Rua da Praia sn,Salvador,30079300,BA,23463284/234-9
3,157,Paulo,Tv. Moraes c/3,Londrina,None,PR,32848223/324-2
4,180,Lívio,Av. Beira Mar n. 1256,Florianópolis,30077500,SC,12736571/2347-4

In [27]:
# Indexando a coluna codigocliente
df = pd.read_sql_query('select * from cliente', engine, index_col = 'codigocliente')

In [28]:
df.head()

,nomecliente,endereco,cidade,cep,uf,cpf
codigocliente,,,,,,
20,Beth,Av. Climério n. 45,São Paulo,25679300,SP,32485126/7326-8
110,Jorge,Rua Caiapo 13,Curitiba,30078500,PR,14512764/9834-9
130,Edmar,Rua da Praia sn,Salvador,30079300,BA,23463284/234-9
157,Paulo,Tv. Moraes c/3,Londrina,None,PR,32848223/324-2
180,Lívio,Av. Beira Mar n. 1256,Florianópolis,30077500,SC,12736571/2347-4

In [68]:
query = '''
SELECT codigocliente, nomecliente
FROM cliente
WHERE uf = %s;
'''

In [69]:
df = pd.read_sql_query(query, engine, params=['SP'])

In [70]:
df

   codigocliente           nomecliente
0             20  Beth
1            290  Renato
2            830  Maurício
3            870  Flávio

**Método read_sql**

In [74]:
# Faz um roteamento entre o read_sql_query e o read_sql_table
# Tanto faz passar uma tabela ou uma query, o read_sql identifica e retorna mesmo assim
df = pd.read_sql('itemdopedido', engine)

In [75]:
df.head()

   numpedido  codigoproduto  quantidade  precounitario  desconto
0        138             22          10           0.10       0.0
1        119             22          10           0.11       0.0
2        121             25          10           0.97       0.0
3        111             25          10           0.97       0.0
4        143             31          20           0.80       0.0

In [78]:
query = '''
SELECT numpedido, quantidade
FROM itemdopedido
WHERE quantidade >= %s;
'''

In [81]:
df = pd.read_sql(query, engine, params=['20'])

In [82]:
df.head()

   numpedido  quantidade
0        143          20
1        121          35
2         97          20
3        103          37
4        119          43

# Método to_sql

In [83]:
df = pd.read_csv('olist_orders_dataset.csv')

In [84]:
df.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [85]:
df.to_sql(name='orders', con = engine)

In [87]:
df.to_sql(name='orders', con = engine, index = False, if_exists='replace')